---
type: Part
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# Part

`Autodesk.Revit.DB.Part` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CanOffsetFace | 2012 | `public bool CanOffsetFace ( Face face )` |
| Method | GetFaceOffset | 2012 | `public double GetFaceOffset ( Face face )` |
| Method | GetSourceElementIds | 2013 | `public ICollection < LinkElementId > GetSourceElementIds ()` |
| Method | GetSourceElementOriginalCategoryIds | 2013 | `public ICollection < ElementId > GetSourceElementOriginalCategoryIds ()` |
| Method | ResetFaceOffset | 2012 | `public void ResetFaceOffset ( Face face )` |
| Method | ResetPartShape | 2012 | `public void ResetPartShape ()` |
| Method | SetFaceOffset | 2012 | `public void SetFaceOffset ( Face face , double offset )` |
| Property | Excluded | 2013 | `public bool Excluded { get ; set ; }` |
| Property | OriginalCategoryId | 2013 | `public ElementId OriginalCategoryId { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | PartMaker | 2012 | `public PartMaker PartMaker { get ; }` |